<template>
  <div class="mainBox">
    <div class="mainContent">
      <el-tabs tab-position="left">
        <el-tab-pane label="职工生日会">
          <Birthday></Birthday>
        </el-tab-pane>
        <el-tab-pane label="工会在身边">
          <el-card class="box-card">
            <div slot="header" class="box-title">
              <span>工会在身边</span>
            </div>
            <el-collapse v-model="active">
              <el-collapse-item name="1" v-for="(item, index) in around" :key="index">
                <template slot="title">
                  <el-link @click="handleClick(item)" target="_blank">{{item.title}}</el-link>
                </template>
                <Card :info="item.info" :date="item.date" :author="item.author"></Card>
              </el-collapse-item>
            </el-collapse>
          </el-card>
        </el-tab-pane>
        <el-tab-pane label="困难帮扶">
          <Help></Help>
        </el-tab-pane>
        <el-tab-pane label="女工关怀">
          <el-card class="box-card">
            <div slot="header" class="box-title">
              <span>女工关怀</span>
            </div>
            <el-collapse v-model="active">
              <el-collapse-item name="1" v-for="(item, index) in woman" :key="index">
                <template slot="title">
                  <el-link @click="handleClick(item)" target="_blank">{{item.title}}</el-link>
                </template>
                <Card :info="item.info" :date="item.date" :author="item.author"></Card>
              </el-collapse-item>
            </el-collapse>
          </el-card>
        </el-tab-pane>
        <el-tab-pane label="助学贷款">
          <Study></Study>
        </el-tab-pane>
      </el-tabs>
    </div>
  </div>
</template>

<script>
  import { mapGetters } from 'vuex'
  import Birthday from '../../components/Birthday'
  import Card from '../../components/Card'
  import Help from '../../components/Help'
  import Study from '../../components/Study'

  export default {
    name: 'Live',
    components: {Birthday, Card, Help, Study},
    computed: {
      ...mapGetters([
        'name'
      ])
    },
    data() {
      return {
        position: 'left',
        active: ['1','2','3','4'],
        around: [
          {
            title: '张主席慰问“田浩技师创新工作室”',
            imgs: 'http://nggh.nisco.cn/UploadFiles/xwdt/2020/8/202008181417310602.jpg',
            author: '陈虹',
            date: '2020-08-19',
            info: ' 8月18日，公司工会主席张六喜带领公司工会部门负责人，来到研究院“田浩技师创新工作室“，为高温下坚守岗位的人员送上冷饮、矿泉水、毛巾等防暑降温用品，并为田浩颁....',
            content:'<img alt="" src="http://nggh.nisco.cn/UploadFiles/xwdt/2020/8/202008181417310602.jpg" style="width: 563px; height: 563px;" />' +
              '<p>&emsp;&emsp;8月18日，公司工会主席张六喜带领公司工会部门负责人，来到研究院“田浩技师创新工作室“，为高温下坚守岗位的人员送上冷饮、矿泉水、毛巾等防暑降温用品，并为田浩颁发了江苏省”最美抗疫职工“荣誉证。（陈虹）</p>'
          },
          {
            title: '关爱职工 夏送清凉 公司慰问一线职工',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008040933445786.jpg',
            author: '赵莉',
            date: '2020-08-04',
            info: '骄阳似火，高温闷热， 8月3日下午，最高气温达到36度，公司工会主席张六喜，公司副总裁徐晓春，公司工会副主席杨桥东和工会部门负责人及部分工作人员，顶着烈日带着藿香正气水、人丹、花露水等清凉套装依次来到梅桂营站（上海铁路局南京东站梅桂营货运部....',
            content:'<p>&emsp;&emsp;骄阳似火，高温闷热，8月3日下午，最高气温达到36度，公司工会主席张六喜，公司副总裁徐晓春，公司工会副主席杨桥东和工会部门负责人及部分工作人员，顶着烈日带着藿香正气水、人丹、花露水等清凉套装依次来到梅桂营站（上海铁路局南京东站梅桂营货运部）、燃料供应厂焦炉作业区、第一炼铁厂一号炉、第二炼钢厂转炉平台、保卫部门岗，慰问奋战在高温一线的职工。</p>' +
              '<p>&emsp;&emsp;在慰问现场，张六喜和徐晓春与在岗位上战高温的职工一一握手，送上公司工会为大家准备的慰问品，并和现场职工做了交流，张主席表示在高温下作业的职工们辛苦了，持续的高温会给高温岗位上的职工带来身体上的不适，希望大家能做好防暑降温工作，同时叮嘱各生产一线的领导要及时关注并维护好职工身体健康，保障职工平安健康度过炎夏天。</p>' +
              '<p>&emsp;&emsp;徐晓春表示，天气炎热，一线高温岗位的职工们非常辛苦，希望大家合理安排工作时间和休息时间，保护好身体，才能有效的工作，并鼓励职工保持干劲为完成南钢8月份生产经营指标共同努力。</p>' +
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008040933445786.jpg" style="width: 563px; height: 563px;" />' +
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008040934088117.jpg" style="width: 563px; height: 563px;" />' +
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008040934316976.jpg" style="width: 563px; height: 563px;" />' +
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008040935241461.jpg" style="width: 563px; height: 563px;" />' +
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008040936285238.jpg" style="width: 563px; height: 563px;" />' +
              '<p>文/图 赵莉</p>'
          },
          {
            title: '防洪抗台 保产保供”公司慰问抗洪保产一线员工',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2020/7/202007240922158238.jpg',
            author: '赵莉',
            date: '2020-07-24',
            info: '7月23日，公司工会张六喜、集团公司总裁余长林、公司副总裁徐晓春带着慰问品来到防汛、保料工作单位：铁路16#道口，21#道口水厂泵房，港池码头，原料厂4#料条，慰问抗战在洪水形势严峻下工作的一....',
            content:'<p>&emsp;&emsp;7月23日，公司工会张六喜、集团公司总裁余长林、公司副总裁徐晓春带着慰问品来到防汛、保料工作单位：铁路16#道口，21#道口水厂泵房，港池码头，原料厂4#料条，慰问抗战在洪水形势严峻下工作的一线员工。</p>' +
              '<p>&emsp;&emsp;进入汛期以来长江水位持续上涨，并且已超出警戒线1.4m，公司原辅料码头、低洼区域、梅桂营车站等区域不仅出现了江水、河水上漫，而且严重影响到公司的生产组织与保产保供。为确保公司正常的生产经营秩序，满足铁前正常的生产用料需求，公司工会组织开展了&ldquo;防洪抗台保产保供&rdquo;劳动竞赛。公司成立防汛抗洪保产指挥部，每日召开推进会，协调解决保产保供遇到的难点与痛点，组建以祝总裁、张主席、徐副总牵头的防汛抗洪保产保供攻关微信群，实时跟进抗洪保供情况。</p>' +
              '<p>&emsp;&emsp;公司防汛抗台指挥部、保料工作组成员，发挥出不怕吃苦，敢于挑战和团结奋进的精神，使用科学有效的技术手段安全有序的开展本阶段防洪抗台工作任务。7月22日炼铁产量破记录达到30166吨，防汛抗洪保供小组有效利用涨退潮的窗口期，采取了汽车焦炭直供、梅桂营铁路线积水强排、朱家山铁路线防汛突击队现场值守、道路交通疏导指引、现场作业人员慰问、防汛抗洪指挥部统筹协调与推进等措施，快速扭转了库存下降的局面，焦炭、矿石、煤实现保供增储。在各部门系统性攻关能力、作业效率、信心士气越来越高。</p>' +
              '<p>&emsp;&emsp;7月22日，共调进各类原燃料8.65万吨，其中铁辅料6.43万吨、燃料2.22万吨，满足了公司持续性的高效安全生产的需求。公司、事业部、机关部室各位领导更是高度重视，频繁的涉水深入一线进行指挥，就管理措施、作业方法提出改进要求，就员工作业激情进行了鞭策，激发出来现场作业人员和作业设备的内在潜力，用新思维、新行动、新动力、高站位推动了防汛抗洪工作的开展。</p>' +
              '<p>&emsp;&emsp;在慰问现场，张六喜表示目前的重点工作是保产保供保设施运行安全，各保障工作组要以大局为重，做好协调配合工作，组织开展好防汛保产保供竞赛，提高隐患意识和安全防护意识，希望广大职工继续加油，发扬不怕吃苦、勇于奉献的精神，确保打赢防洪保产攻坚战。公司副总裁徐晓春也给现场的员工加油鼓劲：昨天炼铁铁水产量破历史纪录，和各抗洪保供小组的工作是分不开的，希望各小组继续落实好供料，合理安排物流运输，满足铁前工序正常的生产需求，在严峻的汛情下紧紧围绕公司生产经营目标，安全有序的生产，争取突破新记录。</p>' +
              '<p>&emsp;&emsp;文 田信雷 赵莉</p>'+
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/7/202007240922158238.jpg" style="width: 563px; height: 563px;" />'
          },
          {
            title: '抗击疫情 我们与你同在',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2020/3/202003100824335070.jpg',
            author: '方雷',
            date: '2020-03-10',
            info: '继南钢工会为公司全体在岗职工发放12000只抗疫防护包以来 ，3月3日，南钢工会向武钢工会捐赠的100箱免洗手消毒液和2000只口罩也顺利到达武钢。南钢工会在对本单位职工的关心爱护以外还心系疫区兄弟单位，为他们送去南....',
            content:'<p>&emsp;&emsp;继南钢工会为公司全体在岗职工发放12000只抗疫防护包以来&nbsp;，3月3日，南钢工会向武钢工会捐赠的100箱免洗手消毒液和2000只口罩也顺利到达武钢。</p>' +
            '<p>&emsp;&emsp;南钢工会在对本单位职工的关心爱护以外还心系疫区兄弟单位，为他们送去南钢工会的关心和爱护，武钢工会的负责人在接收到捐赠物资后致电南钢工会表示了衷心的感谢。</p>' +
            '<p>&emsp;&emsp;（方雷文 &nbsp;摄）</p>' +
            '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/3/202003100824335070.jpg" style="width: 563px; height: 563px;" />'
          }
        ],
        woman:[
          {
            title: '公司三名女职工文字作品在全国和江苏省获奖-南京钢铁联合有限公司工会',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008181429353457.jpg',
            author: '女职委',
            date: '2020-08-18',
            info: '2020年三八期间，江苏省总工会女职工委员会在全省组织开展了新时代江苏女职工精神大讨论活动，引导全省女职工围绕“新时代江苏女职工精神品格”“她为什么冲锋在抗疫一线”“心目中最美的江苏女职工形象”“女职工与时代发展”等话题展开讨论，并用文字或视频方式书写下自己对女职工....',
            content:'<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/8/202008181429353457.jpg"  style="width: 563px; height: 563px;" />' +
              '<p>&emsp;&emsp;2020年三八期间，江苏省总工会女职工委员会在全省组织开展了新时代江苏女职工精神大讨论活动，引导全省女职工围绕“新时代江苏女职工精神品格”“她为什么冲锋在抗疫一线”“心目中最美的江苏女职工形象”“女职工与时代发展”等话题展开讨论，并用文字或视频方式书写下自己对女职工精神的理解、记录下心目中最美的江苏女职工形象，活动历时两个多月。</p>' +
              '<p>&emsp;&emsp;公司工会女职工委员会在公司全体女职工中开展了征集活动，11个基层工会女职委共征集了49条文字作品，其中既有“顶起半边天”“今日花木兰”“铿锵玫瑰”等的传统描述，更有“奉献”“担当”“独立”“进取”等高频热词。新时代女性的精神面貌和价值追求发生了巨大变化。</p>' +
              '<p>&emsp;&emsp;经省总女职委认真评审，本次活动全省共有100件文字作品入围。南钢新产业投资集团卞云丽、特钢事业部大棒厂张绫的两篇作品荣获“入围奖”。另外，在2019年三八节期间公司工会女职工举办的“家风家训故事”征集活动中，特钢事业部高线厂新进厂大学生陈敏的作品《一步一脚印》，被市总选中推荐参加全国“书香三八”读书征文活动，荣获优秀奖。</p>' +
              '<p>&emsp;&emsp;（女职委）</p>'
          },
          {
            title: '微画安全，助力生产',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2020/6/202006301047478500.jpg',
            author: '女职委',
            date: '2020-06-30',
            info: '在围绕中心服务大局、推进企业高质量发展的进程中，女职工从未缺席；在推进南钢安全生产工作中，女职工同样有担当有作为。“生命至上、安全第一”。在全国第十九个“安全生产月”之际，公司工会女职工委员会开展了以“微....',
            content:'<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/6/202006301047478500.jpg" style="width: 524px; height: 295px;" /> ' +
              '<p>&emsp;&emsp;在围绕中心服务大局、推进企业高质量发展的进程中，女职工从未缺席；在推进南钢安全生产工作中，女职工同样有担当有作为。“生命至上、安全第一”。在全国第十九个“安全生产月”之际，公司工会女职工委员会开展了以“微‘画’安全”为主题的女职工助力安全绘画作品征集活动。</p>' +
              '<p>&emsp;&emsp;公司各级女职工组织切实发挥女职工组织优势，立足女职工特有的细心、热心和责任心，以春风化雨、润物无声的方式，把参与安全生产的行动融入到每一项日常工作，渗透到每一个工作细节，时刻绷紧安全生产这根弦，不断扣牢企业、职工、家庭之间的安全纽带，从源头上防范和减少安全事故发生。打造有温度的安全“微”文化，通过开展“微‘画’安全”助力安全绘画作品征集活动，把安全生产的理念宣传到女职工和职工家庭，不断提升企业安全水平，展现女职工在推进安全生产中的巾帼风采。</p>' +
              '<p>&emsp;&emsp;通过积极组织动员，共征集绘画作品98幅，作者有公司在岗女职工，也有职工子女，年龄最小的4岁，最大的48岁。绘画作品品类丰富，有国画、水粉、素描，也有漫画、电子画，内容紧扣安全主题，充分体现安全生产理念，展示了女职工和职工子女的绘画天赋。经过公司文联书画协会专家的认真评选，共评选出优秀作品20幅，在办公楼门厅集中展示，获得一致好评。</p> ' +
              '<p>&emsp;&emsp;（女工委）</p>'
          },
          {
            title: '公司工会女工委六一前夕看望生病职工子女',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2020/6/202006031005183866.jpg',
            author: '高捷',
            date: '2020-06-03',
            info: '在第71个“六一”国际儿童节到来之际，公司工会女职工委员会委员们带着水果和慰问金，分别前往凤滨嘉园、鑫庭雅苑、杨庄南村、新华七村等职工家中，看望生急病、重病的职....',
            content:'<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/6/202006031005183866.jpg" style="width: 563px; height: 563px;" />' +
              '<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2020/6/202006031005327939.jpg" style="width: 563px; height: 563px;" />' +
              '<p>&emsp;&emsp;在第71个“六一”国际儿童节到来之际，公司工会女职工委员会委员们带着水果和慰问金，分别前往凤滨嘉园、鑫庭雅苑、杨庄南村、新华七村等职工家中，看望生急病、重病的职工子女，为他们送去节日的祝福和特别的关爱。</p>' +
              '<p>&emsp;&emsp;每年“六一”儿童节前夕，公司工会女职工委员会都会对特困、单亲家庭大病儿童以及14周岁以下患重病、急病的职工子女进行梳理统计，今年梳理出长期患病或残疾的病儿9名，患急病经各级医保、公司医改办报销后自费金额达到5000元以上的病儿9名。公司工会女职工委员会分别对他们进行了补助，并选择了四个病儿家庭上门慰问。</p>' +
              '<p>&emsp;&emsp;女工委员们仔细询问了孩子的病情和治疗情况，鼓励职工们克服困难，坚定信心，对生病的孩子及时、尽最大努力给予治疗，让他们健康快乐成长，并祝小朋友们“六一”儿童节快乐！</p> ' +
              '<p>&emsp;&emsp;（高捷 文 杨小丽、田甜）</p>'
          },
          {
            title: '公司工会举办女工干部培训班-南京钢铁联合有限公司工会',
            imgs: 'http://nggh.nisco.cn/UploadFiles/ghgz/2019/12/201912090945207564.jpg',
            author: '张中芳 高捷',
            date: '2019-12-09',
            info: '12月6日，公司工会女职工委员会举办为期一天的女职工干部培训班，邀请南京中医药大学曾智教授、南京市人社局生育保险科王小戟科长分别做题为《职场心灵和谐与自我修炼》以及《生育保....',
            content:'<img alt="" src="http://nggh.nisco.cn/UploadFiles/ghgz/2019/12/201912090945207564.jpg" style="height: 307px; width: 492px" />' +
              '<p>&emsp;&emsp;12月6日，公司工会女职工委员会举办为期一天的女职工干部培训班，邀请南京中医药大学曾智教授、南京市人社局生育保险科王小戟科长分别做题为《职场心灵和谐与自我修炼》以及《生育保险相关政策解读》的专题讲解。公司各级工会女职工干部三十余人参加了培训。</p>' +
              '<p>&emsp;&emsp;公司工会副主席杨桥东做了开班动员。他希望参加培训的女工干部能将培训内容内化于心、外化于行；通过培训彼此之间分享工作经验，加强沟通联系；并介绍了明年公司工会的主要工作思路和重点工作。希望广大工会工作者紧紧围绕“服务企业，服务职工”的工作宗旨，努力做到“围绕中心转，跟着党政走，心中有职工”。</p>' +
              '<p>&emsp;&emsp;南京中医药大学卫生经济管理学院教授、博士，硕士研究生导师，国内知名管理科学培训专家曾智教授从保持心灵和谐是一种调适职场压力的境界和素质、职业发展中自我修炼的智慧、修炼自我，构建和谐的人际关系、加强团队建设，提升团队素养等四个方面阐述了“心灵和谐成为我们实践快乐人生的手段”这一主题。曾教授语言风趣生动，引经据典，从热门电视剧《甄嬛传》的人物分析入手，层层剖析，得出结论：面对现代社会的诸多压力，只有实现自我心灵革命，拥有和谐的心灵，才能享受美好人生。他为女工干部做了一次很好的心理疏导，参培女工干部们受益匪浅，意犹未尽。</p>' +
              '<p>&emsp;&emsp;南京市社保中心生育保险科科长王小戟从参保对象、缴费费率、享受生育保险待遇的条件、待遇标准、就医流程等几方面系统介绍了生育保险的相关政策法规，内容详实，政策性强，对女工干部的日常工作具有指导意义。</p>' +
              '<p>&emsp;&emsp;通过一天的学习培训，工会女职工干部的理论水平、专业技能和服务能力有了进一步提高。</p>' +
              '<p>&emsp;&emsp;文：张中芳 高捷 图：陈虹</p>'
          }
        ]
      }
    },
    methods: {
      handleClick(item) {
        this.$router.push({
          path: 'details',
          params: {
            article: item
          }
        })
      },
      goto(url) {
        console.log(url)
        this.$router.push(url || './')
      }
    }

  }
</script>

<style lang="scss" scoped>
</style>
