<template>
  <div class="mainBox">
    <div class="time-axis">
      <div class="axis"></div>
      <div :class="['time-event', index % 2 === 0 ? 'right' : 'left']" v-for="(item, index) in activities" :key="index">
        <div class="circle img-wrapper">
          <img :src="require('@/assets/images/icon/circle.png')" />
        </div>
        <card-time :data="item" :direction="index % 2 === 0 ? 'left' : 'right'" ></card-time>
      </div>
    </div>
  </div>
</template>

<script>
  import { mapGetters } from 'vuex'
  import CardPic from '../../components/CardPic'
  import cardTime from '../../components/news/cardTime'

  export default {
    name: 'Live',
    components: { CardPic, cardTime },
    computed: {
      ...mapGetters([
        'name'
      ])
    },
    methods: {
      handleClick(item) {
        this.$router.push({
          name: '详情',
          params: {
            article: item
          }
        })
      }
    },
    data() {
      return {
        list: [1, 2, 3, 4, 1, 2, 3, 4, 4, 1, 2, 3, 4],
        activities: [
          {
//          content: '支持使用图标',
          timestamp: '2020-08-27 20:46',
          size: 'large',
          type: 'primary',
          position: 'top',
          icon: 'el-icon-check',
          title: '黄一新：积极转变 顺应“数智化”时代发展浪潮',
          imgs: 'http://www.njsteel.com.cn/Upload/images/1(25).jpg',
          author: '匿名',
          date: '2020年08月27日',
          classify: '2020-08-27',
          content: '<img alt="" src="http://www.njsteel.com.cn/Upload/images/1(25).jpg" style="width: 640px; height: 425px;" /><br />\n' +
          '<p>8月26日，南钢股份入选&ldquo;新华社民族品牌工程&rdquo;签约仪式在京举行。南钢股份董事长黄一新就如何应对&ldquo;逐步形成以国内大循环为主体、国内国际双循环相互促进的新发展格局&rdquo;这一转变、如何看待传统产业借力资本市场加速转型发展等问题接受了专访。</p>\n' +
          '<p>紧抓数字化转型机遇 积极变革组织状态</p>\n' +
          '<p>当前，面对疫情影响和世界经济低迷，逐步形成以国内大循环为主体、国内国际双循环相互促进的新发展格局正成为中国经济发展的重中之重，将为我国经济发展提供助力，也为钢铁工业的发展带来新变化。作为国家第二个&ldquo;五年计划&rdquo;战略布局的地方骨干钢铁企业、被誉为江苏钢铁工业&ldquo;摇篮&rdquo;的南钢，在国内国际双循环相互促进的&ldquo;新发展格局&rdquo;中，同样面临着更大机遇和挑战。</p>\n' +
          '<p>8月20日举办的扎实推进长三角一体化发展座谈会指出，长三角不仅要提供优质产品，更要提供高水平科技供给，支撑全国高质量发展。黄一新表示，&ldquo;新发展格局&rdquo;是中国应对世界经济低迷、全球市场萎缩的重要措施。南钢作为长三角区域的一员，必将以只争朝夕的拼搏精神抓落实，以奋发有为的崭新面貌谋发展，既谋划长远，又干在当下，进一步发挥人才富集、产业基础好、创新能力强等诸多优势，积极探索形成&ldquo;新发展格局&rdquo;的路径。</p>\n' +
          '<p>黄一新指出，高质量发展、数智化时代要倡导六大新思维：战略生态化、组织平台化、人才合伙化、领导赋能化、要素社会化、运营数字化，核心是组织能力建设与人才机制。我们所处的数字化时代是百年不遇的大变局，南钢要做世界头部企业，首要因素是组织能力提升。未来的主流组织模式是平台+小前端（项目、自主经营体）+生态组织，南钢将进行组织状态的大变革，推进团队协同效应最大化，进一步深化钢铁主业的高效率低成本智造。</p>\n' +
          '<p>&ldquo;面向未来，南钢要实践从经营产品到经营客户、从经营市场到经营数据、从经营企业到经营生态的三大转变。&rdquo;黄一新强调，要以客户为中心，以客户的价值创造为导向；数字化时代管理的出发点和落脚点就是数据；工业互联网时代是资源整合的时代，讲究的是平台、生态；数字化转型是全员工程，数字化要成为员工的基因；要重新定义、挖掘、塑造企业文化和价值观。</p>\n' +
          '<p>有效借力资本市场 推动产业结构转型升级</p>\n' +
          '<p>2000年，南钢股份在上海证券交易所上市，2010年，南钢股份实现钢铁资产整体上市。2019年，南钢股份营业收入479.70亿元，利润总额39.02亿元。</p>\n' +
          '<p>对于南钢借助资本市场，成功实现战略转型，黄一新表示，传统产业更要重视资本市场，借力资本，加速转型升级。南钢股份始终积极探索产融协同发展，有效借助资本市场进行多元化资本运作。2000年上市以来，南钢股份通过资本市场累计实现直接融资合计243.24亿元，其中股权融资172.24亿元，占比约70%，有力地支持了产业发展壮大。</p>\n' +
          '<p>黄一新指出，2017年以来，公司抓住钢铁行业供给侧改革红利，定增募集资金17.88亿元，主要用于超低排放、高效发电、智慧中心项目，支持产业高质量发展。</p>\n' +
          '<p>&ldquo;今年7月，我们完成了发行股份购买资产，提升归母净利润。&rdquo;黄一新强调，近年来，南钢股份提倡&ldquo;共创共享&rdquo;的企业文化，实施了钢铁行业上市公司首例标准的员工持股计划，自2017年连续三年推出股权激励计划，将股东利益、公司利益和员工个人利益结合在一起，促使各方共同关注公司的可持续发展。</p>\n' +
          '<p>2019年，南钢股份营业收入480亿元，钢铁行业上市公司排名第14位；净利润33.65亿元，排名第6位；进入《财富》中国500强，竞争力大幅提升，企业发展进入新阶段。</p>\n' +
          '<p>黄一新表示，进入2020年，站在新的起点上，公司将进一步借力资本市场，推进产业结构调整和转型升级，增强企业核心竞争力，加快推动南钢股份高质量发展和转型升级。</p>\n' +
          '<p>（文章来源于新华网、新华印记、新华信用、半月谈、中国财富网 、经济参考联合报道）。</p>'
        },
          {
//          content: '支持自定义颜色',
          timestamp: '2020-08-27 20:46',
          position: 'top',
          type: 'primary',
          icon: 'el-icon-check',
          title: '南钢股份入选新华社民族品牌工程',
          imgs: 'http://www.njsteel.com.cn/Upload/images/%E5%BE%AE%E4%BF%A1%E5%9B%BE%E7%89%87_20200827081009.jpg',
          author: '匿名',
          date: '2020年08月27日',
          classify: '2020-08-27',
          content: '<img alt="" src="/Upload/images/%e5%be%ae%e4%bf%a1%e5%9b%be%e7%89%87_20200827081009.jpg" style="width: 640px; height: 426px;" />' +
          '<p>8月26日，南京钢铁股份有限公司（以下简称&ldquo;南钢股份&rdquo;）入选新华社民族品牌工程签约仪式在京举行，新华社下属各服务机构将与南钢股份展开全面合作，共同打造高端制造业品牌，助力南钢股份品牌建设和高质量发展。</p>\n' +
          '<p>南钢始建于1958年，是国家第二个&ldquo;五年计划&rdquo;战略布局的地方骨干钢铁企业，被誉为江苏钢铁工业摇篮。2000年，南钢股份在上海证券交易所上市，2010年，南钢股份实现钢铁资产整体上市。2019年，南钢股份营业收入479.70亿元，利润总额39.02亿元。</p>\n' +
          '<p>南钢股份董事长黄一新表示，南钢正力求从传统制造业向绿色、智慧、高科技产业集团转型，新华社民族品牌工程为我国优秀民族品牌进一步发力海内外市场，加快品牌国际化进程提供了更高规格、更高质量、更高水准的平台。对形成全社会崇尚品牌、关心品牌、爱护品牌、争创品牌的良好氛围，助推中国品牌走向世界具有里程碑意义。南钢股份将借助新华社极具优势的全球传播资源，讲好南钢故事，讴歌时代风采，助推南钢品牌建设和高质量发展从&ldquo;高原攀上高峰&rdquo;。</p>\n' +
          '<p>中国证券报总编辑徐寿松表示，品牌是一张不可缺失的国家名片，品牌崛起的背后是国家、企业、企业家和员工砥砺奋进的创造过程，而媒体能够全面助力品牌建设的水平和速度。新华社民族品牌工程将充分利用新华社丰富的媒体资源、强大的传播渠道和高端的智库力量，服务好以南钢股份为代表的民族企业，助力民族品牌走向世界。</p>\n' +
          '<p>新华社新闻信息中心副主任潘海平与南钢股份副总裁、董事会秘书徐林代表双方签署合作协议。根据协议，双方将在创意策划、品牌推广、海外传播、智库服务、资本市场、定制化服务等方面开展全面务实合作。</p>\n' +
          '<p>新华社副社长刘正荣，新华社下属服务机构负责人出席了签约仪式。</p>\n' +
          '<p>&ldquo;新华社民族品牌工程&rdquo;是响应品牌强国战略的综合服务体系，旨在&ldquo;服务民族企业发展，助力中国品牌建设&rdquo;。目前已服务一批世界500强、中国500强、行业领军企业和区域优秀品牌。</p>\n' +
          '<p>（文章来源于新华社，陆家嘴经融网、<span style="color: rgb(0, 0, 0); font-family: &quot;Microsoft YaHei&quot;, SimHei, arial; font-size: 12px;">新华财经、</span>新华社客户端、新华网、经济参考、中国证券报&middot;中证网、中国名牌网、新华云印等客户端平台联合报道）</p>'
        },
          {
//          content: '支持自定义尺寸',
          position: 'top',
          type: 'primary',
          icon: 'el-icon-check',
          timestamp: '2020-05-09 20:46',
          size: 'large',
          title: '党建领航把方向 凝心聚力攀高峰',
          imgs: 'http://www.njsteel.com.cn/Upload/Images/1d51043f-e3fe-42b9-8bb1-062eaa2f3d8a.png',
          author: '匿名',
          date: '2020年05月09日',
          classify: '2020-05-09',
          content: '<p>党建网讯（邵启明） 4月30日，中国共产党南京钢铁联合有限公司第三次代表大会顺利召开。南钢董事长黄一新当选新一届党委书记。</p>\n' +
          '<p>黄一新在大会上作题为《党建领航把方向 凝心聚力攀高峰》的党委工作报告。报告总结了企业过去五年的发展成就，经营绩效取得新飞跃，经营生态实现新进化，改革创新跨上新高度，新兴产业开辟新格局，党建工作发挥新作为。报告提出五个&ldquo;必须&rdquo;，必须始终坚持党的领导，汇聚发展合力，为公司发展提供坚强的政治保障；必须始终坚持以人为本，激发全员活力，为公司发展提供有力支撑；必须始终坚持创新驱动，增强发展动力，以创新思维破解发展难题；必须坚持强化作风建设，提升组织能力，以担当作为提振精神；必须始终坚持管理变革，挖掘内部潜力，以效能提升推动公司高质量发展。</p>\n' +
          '<p>会议明确了今后五年企业的发展目标，&ldquo;共同推动南钢以指数级增长速度成长为全球化高科技产业集团&rdquo;，聚焦&ldquo;一个愿景&rdquo;、围绕&ldquo;一个目标&rdquo;、把握&ldquo;两条主线&rdquo;、聚焦&ldquo;五大任务&rdquo;、培育&ldquo;六个领先&rdquo;的发展思路；明确了今后五年的党建工作任务，以打造混合所有制企业党建标杆为目标，以创新基层党建工作为载体，推进党建工作与公司生产经营深度融合、同频共振，为发展提供坚强的政治保证、组织保证和精神动力；着力推动&ldquo;五个再提升&rdquo;：推动思想政治建设再提升、推动基层组织建设再提升、推动人才队伍建设再提升、推动品牌文化建设再提升、推动群团工作再提升，为南钢步入迭代腾飞新征程提供保障。</p>\n' +
          '<p>中共南京市委相关领导到会指导，对南钢5年来以高质量党建引领企业高质量发展取得的成绩表示充分肯定。（南京钢铁联合有限公司党委供稿）</p>\n'
        },
          {
//          content: '默认样式的节点',
          icon: 'el-icon-check',
          type: 'primary',
          position: 'top',
          timestamp: '2020-05-09 20:46',
          title: '南钢打造全球化高科技产业集团',
          imgs: 'http://www.njsteel.com.cn/Upload/images/1(25).jpg',
          author: '匿名',
          date: '2020年05月09日',
          classify: '2020-05-09',
          content: '<p>本报讯（融媒体记者 王健 通讯员 邵启明）作为全市制造业标杆企业，继实现数代工作者梦寐以求的&ldquo;双千&rdquo;梦想后，南钢又确定了新的五年发展目标：以指数级增长速度成长为全球化高科技产业集团。这是记者近日从南钢获得的消息。</p>\n' +
          '<p>据介绍，近期南钢召开第三次党代会，总结过去五年发展成就，确定今后五年发展目标。</p>\n' +
          '<p>过去五年，南钢的铁、钢、材产量连年大幅提升，实现了数代南钢人梦寐以求的&ldquo;双千&rdquo;梦想&mdash;&mdash;2019年实现产钢1097万吨，比2015年增加238万吨；营业收入由2015年的446亿元提高到2019年的1373亿元；利润总额连续打破历史纪录，从2015年亏损到2018年、2019年分别实现60亿元、45亿元。</p>\n' +
          '<p>与此同时，2015&mdash;2019年，南钢纳税总额达107亿元，经济效益综合指数、全员劳动生产率、人均产钢、人均利税、人均利润等一系列体现企业核心竞争力的重要指标均稳居行业前三，近三年更是连续被评为行业最高等级&ldquo;A+级竞争力极强&rdquo;企业。南钢还进入江苏省十大企业行列，在南京市位居第二，在全市制造业中排名第一。</p>\n' +
          '<p>此外，五年来，南钢经营生态实现新进化、改革创新跨上新高度、新产业开辟新格局，2019年新产业实现利润6.89亿元，是成立之初利润的4.2倍。</p>\n' +
          '<p>当选新一届党委书记的南钢董事长黄一新说，今后五年，南钢将聚焦一个愿景，围绕一个目标，把握两条主线，切实抓好五大任务，努力培育六个领先，共同推动南钢以指数级增长速度成长为全球化高科技产业集团。</p>\n' +
          '<p>&ldquo;一个愿景&rdquo;就是创建国际一流受尊重的企业智慧生命体。&ldquo;一个目标&rdquo;是实现双百亿利润、千亿美元管理市值的高科技产业集团。&ldquo;两条主线&rdquo;是坚持高质量党建和高质量发展。&ldquo;六个领先&rdquo;即领先的价值主张与最优管理实践，领先的生产智造能力，领先的全球化能力，领先的品牌影响力与品牌价值，领先的技术、创新能力，领先的运营效率和行业地位。</p>\n' +
          '<p>&ldquo;五大任务&rdquo;具体为：深度聚焦智慧经营，提升精品智造能力；深度聚焦管理变革，实现组织能力再进化；深度聚焦创新引领，增强企业核心竞争力；深度聚焦新产业发展，发挥逆周期中流砥柱作用；深度聚焦生态建设，打造和谐共融新南钢。</p>\n' +
          '<p>(原载于：2020-5-8&nbsp;&nbsp; 南京日报)</p>\n'
        }
        ]
      }
    }
  }
</script>

<style lang="scss" scoped>

.img-wrapper {
  // width: 15px;
  // height: 15px;
  display: flex;
  align-items: center;
  justify-content: center;
  img {
    display: block;
    max-height: 100%;
    max-width: 100%;
  }
}

.time-axis {
  width: 1200px;
  position: relative;
  padding-top: 70px;
  .axis {
    width: 25px;
    height: 100%;
    position: absolute;
    left: 50%;
    overflow: visible;
    background-image: url('../../assets/images/icon/time-axis.png');
    background-repeat: repeat-y;
    // &::before {
    //   content: '';
    //   border: 1px solid #b5b5b5;
    //   width: 23px;
    //   top: -1px;
    //   position: absolute;
    // }
  }
  .time-event {
    position: relative;
    width: 470px;

    &.right {
      left: 50%;
      margin-left: 63px;
      .circle {
        left: -69px;
      }
    }
    &.left {
      left: calc(50% - 470px);
      margin-left: -63px;
      .circle {
        right: -71px;
      }
    }
    .circle {
      &.img-wrapper {
        width: 14px;
        height: 14px;
      }
      position: absolute;
      top: 30px;
    }
  }
}
</style>
